maximum-commitment/stm32_can/Src/main.c
    ulFPUInterruptNesting--;
}
/*-----------------------------------------------------------*/

static void prvOptionallyCreateComprehensveTestApplication( void )
{
    #if ( mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY == 0 )
    {
        TimerHandle_t xCheckTimer = NULL;

        /* Configure the interrupts used to test FPU registers being used from
         * nested interrupts. */
        prvSetupNestedFPUInterruptsTest();
#ifdef FREERTOS_TESTCODE
        /* Start all the other standard demo/test tasks. */
        vStartIntegerMathTasks( tskIDLE_PRIORITY );
        vStartDynamicPriorityTasks();
        vStartBlockingQueueTasks( mainBLOCK_Q_PRIORITY );
        vCreateBlockTimeTasks();
        vStartCountingSemaphoreTasks();
        vStartGenericQueueTasks( tskIDLE_PRIORITY );
        vStartRecursiveMutexTasks();
        vStartPolledQueueTasks( mainQUEUE_POLL_PRIORITY );
        vStartSemaphoreTasks( mainSEM_TEST_PRIORITY );
#endif
#ifdef FREERTOS_TESTCODE
        /* Most importantly, start the tasks that use the FPU. */
        vStartMathTasks( mainFLOP_TASK_PRIORITY );
#endif
        /* Create the register check tasks, as described at the top of this
         * file */
        xTaskCreate( vRegTest1Task, "Reg1", configMINIMAL_STACK_SIZE, ( void * ) NULL, tskIDLE_PRIORITY, NULL );
        xTaskCreate( vRegTest2Task, "Reg2", configMINIMAL_STACK_SIZE, ( void * ) NULL, tskIDLE_PRIORITY, NULL );

        /* Create the semaphore that is used to demonstrate a task being
         * synchronised with an interrupt. */
        vSemaphoreCreateBinary( xTestSemaphore );

        /* Create the task that is unblocked by the demonstration interrupt. */
        xTaskCreate( prvButtonTestTask, "BtnTest", configMINIMAL_STACK_SIZE, ( void * ) NULL, tskIDLE_PRIORITY, NULL );

        /* Create the software timer that performs the 'check' functionality,
         * as described at the top of this file. */
        xCheckTimer = xTimerCreate( "CheckTimer",                  /* A text name, purely to help debugging. */
                                    ( mainCHECK_TIMER_PERIOD_MS ), /* The timer period, in this case 3000ms (3s). */
                                    pdTRUE,                        /* This is an auto-reload timer, so xAutoReload is set to pdTRUE. */
                                    ( void * ) 0,                  /* The ID is not used, so can be set to anything. */
                                    prvCheckTimerCallback          /* The callback function that inspects the status of all the other tasks. */
                                    );

        if( xCheckTimer != NULL )
        {
            xTimerStart( xCheckTimer, mainDONT_BLOCK );
        }
#ifdef FREERTOS_TESTCODE
        /* This task has to be created last as it keeps account of the number of
         * tasks it expects to see running. */
        vCreateSuicidalTasks( mainCREATOR_TASK_PRIORITY );
#endif
    }
    //#else /* mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY */
    {
        /* Just to prevent compiler warnings when the configuration options are
         * set such that these static functions are not used. */
        ( void ) vRegTest1Task;
        ( void ) vRegTest2Task;
        ( void ) prvCheckTimerCallback;
        ( void ) prvSetupNestedFPUInterruptsTest;
    }
    #endif /* mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY */
}
/*-----------------------------------------------------------*/

void EXTI9_5_IRQHandler( void )
{
    long lHigherPriorityTaskWoken = pdFALSE;

    /* Only line 6 is enabled, so there is no need to test which line generated
     * the interrupt. */
    //EXTI_ClearITPendingBit( EXTI_Line6 );
    /* Note trigger param appears to be unused by driver, perhaps will be in future update */
    /* Note callback pointer also unused, but this will likely be permanent */
    EXTI_HandleTypeDef hexti = {.Line = LL_SYSCFG_EXTI_LINE6, .PendingCallback = NULL};
    HAL_EXTI_ClearPending(&hexti, EXTI_TRIGGER_NONE /* param unused */);

#ifdef COMPILEOUT_INITIAL_TEST_APP
    /* This interrupt does nothing more than demonstrate how to synchronise a
     * task with an interrupt.  First the handler releases a semaphore.
     * lHigherPriorityTaskWoken has been initialised to zero. */
    xSemaphoreGiveFromISR( xTestSemaphore, &lHigherPriorityTaskWoken );
#endif

    /* If there was a task that was blocked on the semaphore, and giving the
     * semaphore caused the task to unblock, and the unblocked task has a priority
     * higher than the currently executing task (the task that this interrupt
     * interrupted), then lHigherPriorityTaskWoken will have been set to pdTRUE.
     * Passing pdTRUE into the following macro call will cause this interrupt to
     * return directly to the unblocked, higher priority, task. */
    portEND_SWITCHING_ISR( lHigherPriorityTaskWoken );
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
    /* vApplicationMallocFailedHook() will only be called if
     * configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
     * function that will get called if a call to pvPortMalloc() fails.
     * pvPortMalloc() is called internally by the kernel whenever a task, queue,
     * timer or semaphore is created.  It is also called by various parts of the
     * demo application.  If heap_1.c or heap_2.c are used, then the size of the
     * heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
     * FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
     * to query the size of free heap space that remains (although it does not
     * provide information on how the remaining heap might be fragmented). */
    taskDISABLE_INTERRUPTS();

    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
    /* vApplicationIdleHook() will only be called if configUSE_IDLE_HOOK is set
     * to 1 in FreeRTOSConfig.h.  It will be called on each iteration of the idle
     * task.  It is essential that code added to this hook function never attempts
     * to block in any way (for example, call xQueueReceive() with a block time
     * specified, or call vTaskDelay()).  If the application makes use of the
     * vTaskDelete() API function (as this demo application does) then it is also
     * important that vApplicationIdleHook() is permitted to return to its calling
     * function, because it is the responsibility of the idle task to clean up
     * memory allocated by the kernel to any task that has since been deleted. */
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t pxTask,
                                    char * pcTaskName )
{
    ( void ) pcTaskName;
    ( void ) pxTask;

    /* Run time stack overflow checking is performed if
     * configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
     * function is called if a stack overflow is detected. */
    taskDISABLE_INTERRUPTS();

    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/
